##ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ – ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΤΡΙΤΗ 10 ΙΟΥΝΙΟΥ 2025
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ Γ
##Ένα πλανητάριο δέχεται τέσσερα (4) σχολεία ανά ημέρα, για πέντε (5)
##ημέρες. Θεωρήστε ότι κατά το διάστημα αυτό κάθε σχολείο επισκέπτεται το
##πλανητάριο μόνο μία φορά. Το πλήθος των μαθητών ανά σχολείο είναι από
##είκοσι (20) έως και πενήντα (50) μαθητές. Η τιμή του εισιτηρίου για κάθε
##μαθητή είναι τέσσερα (4) ευρώ.
##Να αναπτύξετε πρόγραμμα σε γλώσσα προγραμματισμού Python το οποίο:
##Γ1. Για κάθε μία από τις πέντε (5) ημέρες και για κάθε σχολείο να διαβάζει:
##α) Το όνομα του σχολείου. (μον.2)
##β) Τον τύπο του σχολείου ("ΕΠΑΛ" για Επαγγελματικό Λύκειο, "ΠΕΠΑΛ" για
##Πρότυπο Επαγγελματικό Λύκειο, "ΓΕΛ" για Γενικό Λύκειο, "ΜΟΥΣ" για
##Μουσικό σχολείο). (μον.2)
##γ) Το πλήθος των μαθητών του σχολείου. Να γίνεται έλεγχος ορθότητας,
##ώστε το πλήθος των μαθητών που καταχωρίζονται να είναι από είκοσι (20)
##έως και πενήντα (50) μαθητές. (μον.6)
##Μονάδες 10
##Γ2. Να υπολογίζει και να εμφανίζει το κόστος των εισιτηρίων για κάθε
##σχολείο. Για τον σκοπό αυτό να γίνεται κλήση της συνάρτησης
##YPOLOGISMOS(), όπως περιγράφεται στο ερώτημα Γ3.
##Μονάδες 3
##Γ3. Να υλοποιεί συνάρτηση με όνομα YPOLOGISMOS, η οποία δέχεται το
##πλήθος των μαθητών ενός σχολείου και επιστρέφει το κόστος των εισιτηρίων
##του σχολείου.
##Μονάδες 3
##Γ4. Να υπολογίζει και να εμφανίζει:
##α) Τα συνολικά έσοδα του πλανηταρίου από τις επισκέψεις των σχολείων. (μον.3)
##β) Το ποσοστό των μαθητών των Πρότυπων Επαγγελματικών Λυκείων (ΠΕΠΑΛ)
##που επισκέφθηκαν το πλανητάριο κατά τη διάρκεια των πέντε (5) ημερών. (μον.6)
##Μονάδες 9
##Σημείωση: Θεωρήστε ότι υπάρχει τουλάχιστον ένα (1) σχολείο από κάθε τύπο
##σχολείου στη διάρκεια των πέντε (5) ημερών.
##
def YPOLOGISMOS(eisitiria):
    TIMH = 4
    return TIMH*eisitiria

SXOLEIA = 4
HMERES = 5
KATW = 20
PANW = 50

synol_mathites = 0
synol_esoda = 0
mathites_pepal = 0

try:
    print("Ανάγνωση του αρχείου εισόδου...\n")
    INPUTFILENAME="mathites.txt"
    with open(INPUTFILENAME, 'r', encoding="utf-8") as inputfile:
        for hmera in range(1, HMERES+1):
            print("Ημέρα {}".format(hmera))
            for sxoleio in range(1, SXOLEIA+1):
                onoma_sxoleiou = inputfile.readline().strip('\n').strip('\ufeff')
                print("Όνομα σχολείου {}: {}".format(sxoleio, onoma_sxoleiou))
                typos_sxoleiou = inputfile.readline().strip('\n').strip('\ufeff')
                print("Τύπος σχολείου {} [ΕΠΑΛ, ΠΕΠΑΛ, ΓΕΛ, ΜΟΥΣ]: {}".format(sxoleio, typos_sxoleiou))
                mathites = ""
                while not mathites.isdigit() \
                  or int(mathites) not in range(KATW, PANW+1):
                    mathites = inputfile.readline().strip('\n').strip('\ufeff')
                    print("Πλήθος μαθητών του σχολείου {} (20-50): {}".format(sxoleio, mathites))
                mathites = int(mathites)
                synol_mathites += mathites
                print("Κόστος εισιτηρίων για το σχολείο {}: €{}".format(sxoleio, YPOLOGISMOS(mathites)))
                synol_esoda += YPOLOGISMOS(mathites)
                if typos_sxoleiou=="ΠΕΠΑΛ":
                    mathites_pepal += mathites
    print("Συνολικά έσοδα του πλανηταρίου: €{}".format(synol_esoda))
    print("Ποσοστό μαθητών των Πρότυπων Επαγγελματικών Λυκείων (ΠΕΠΑΛ) που επισκέφθηκαν το πλανητάριο: {:.1%}".format(mathites_pepal / synol_mathites))
except Exception as err:
    print("Σφάλμα στην ανάγνωση του αρχείου εισόδου!", err)
