##ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ – ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΤΡΙΤΗ 10 ΙΟΥΝΙΟΥ 2025
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ B
##B2. Η παρακάτω συνάρτηση δέχεται μία λίστα (listA) που περιέχει λέξεις
##και επιστρέφει μία συμβολοσειρά που δημιουργείται από τα αρχικά γράμματα
##των λέξεων της λίστας (listA).
##def newWord (listA):
##    arxika = (1)
##    for (2) in listA :
##        arxika = (3) + lexi[ (4) ]
##    return (5)
##Να γράψετε στο τετράδιό σας τους αριθμούς (1), (2), (3), (4) και (5) που
##αντιστοιχούν στα κενά της παραπάνω συνάρτησης και δίπλα σε καθέναν από
##τους αριθμούς αυτό που πρέπει να συμπληρωθεί, ώστε η συνάρτηση να
##εκτελεί την αναφερόμενη λειτουργία.
##Μονάδες 10
##
def newWord(listA):
    arxika = ""
    for lexi in listA :
        arxika = arxika + lexi[0]
    return arxika

listA=["word","arxika","lexi","list","new","for","return"]
arxika=newWord(listA)
print("Λίστα που περιέχει λέξεις: {}".format(listA))
print("Αρχικά γράμματα των λέξεων της λίστας: {}".format(arxika))

##def newWord (listA):
##    arxika = (1)    ## (1) ""
##    for (2) in listA :    ## (2) lexi
##        arxika = (3) + lexi[ (4) ]    ## (3) arxika, (4) 0
##    return (5)    ## (5) arxika
##
##B3. Δίνεται η συμβολοσειρά word="ΠΡΟΤΥΠΟ ΕΠΑΛ".
##Να γράψετε στο τετράδιό σας τι θα εμφανίσει η εκτέλεση
##του παρακάτω τμήματος προγράμματος:
##print "1.",word[:7]
##print "2.",word[:]
##print "3.",word[3:11]
##print "4.",word[8:len(word)]
##print "5.",word[0]+word[8]
##Μονάδες 5
##
##print "1.",word[:7]
##print "2.",word[:]
##print "3.",word[3:11]
##print "4.",word[8:len(word)]
##print "5.",word[0]+word[8]
##
##1. ΠΡΟΤΥΠΟ
##2. ΠΡΟΤΥΠΟ ΕΠΑΛ
##3. ΤΥΠΟ ΕΠΑ
##4. ΕΠΑΛ
##5. ΠΕ
