##ΠΑΝΕΛΛΑΔΙΚΕΣ ΕΞΕΤΑΣΕΙΣ
##HMEΡΗΣΙΩΝ – ΕΣΠΕΡΙΝΩΝ ΕΠΑΓΓΕΛΜΑΤΙΚΩΝ ΛΥΚΕΙΩΝ
##ΤΡΙΤΗ 10 ΙΟΥΝΙΟΥ 2025
##ΕΞΕΤΑΖΟΜΕΝΟ ΜΑΘΗΜΑ:
##ΠΡΟΓΡΑΜΜΑΤΙΣΜΟΣ ΥΠΟΛΟΓΙΣΤΩΝ
##
##ΘΕΜΑ A
##A2. Να γράψετε στο τετράδιό σας τους αριθμούς 1, 2, 3, 4, 5 από τη στήλη
##Α του παρακάτω πίνακα και δίπλα σε καθέναν από τους αριθμούς, ένα από τα
##γράμματα α, β, γ, δ, ε, στ της στήλης Β, που δίνει τη σωστή
##αντιστοίχιση. Σημειώνεται ότι ένα γράμμα από τη στήλη Β θα περισσέψει.
##ΣΤΗΛΗ Α	    	ΣΤΗΛΗ Β
##1. not(34!=45)    	α. 4
##2. (12<11) or (23>10)	β. 5
##3. 45%10	     	γ. True
##4. 4/(2**0)		δ. False
##5. 45/10.0	   	ε. 4.0
##		    	στ. 4.5
##Μονάδες 10
##
##print not(34!=45)
##print (12<11) or (23>10)
##print 45%10
##print 4/(2**0)
##print 45/10.0
##
##False
##True
##5
##4
##4.5
##
##1. not(34!=45)    	δ. False
##2. (12<11) or (23>10)	γ. True
##3. 45%10	     	β. 5
##4. 4/(2**0)		α. 4
##5. 45/10.0	   	στ. 4.5
##
##ΘΕΜΑ B
##Β1. Δίνεται η παρακάτω κλάση:
##class Politis:
##    def __init__(self, onoma, poliseis):
##        self.onoma=onoma
##        self.poliseis=poliseis
##όπου onoma είναι το ονοματεπώνυμο του πωλητή και poliseis είναι μία
##λίστα με τα μηνιαία έσοδα από τις πωλήσεις που πραγματοποιήθηκαν κατά τη
##διάρκεια τεσσάρων (4) μηνών.
##α) Να δημιουργήσετε μέθοδο με όνομα max_poso(), η οποία υπολογίζει και
##επιστρέφει το μεγαλύτερο μηνιαίο ποσό των πωλήσεών του. (μον.5)
##β) Να δημιουργήσετε ένα στιγμιότυπο της κλάσης Politis ως εξής: politis1
##με τιμές των ιδιοτήτων του, onoma="Ιωάννα Κωνσταντίνου",
##poliseis=[10000, 15000, 5000, 20000]. (μον.2)
##γ) Για το στιγμιότυπο politis1 να βρείτε και να εμφανίσετε το μεγαλύτερο
##ποσό πωλήσεων με χρήση της μεθόδου max_poso() που περιγράφεται στο
##ερώτημα α). (μον.3)
##Μονάδες 10
##
class Politis:
    def __init__(self, onoma, poliseis):
        self.onoma=onoma
        self.poliseis=poliseis
    def max_poso(self):
        max = 0
        for p in self.poliseis:
            if max < p:
                max = p
        return max

politis1 = Politis("Ιωάννα Κωνσταντίνου", [10000, 15000, 5000, 20000])

print(politis1.max_poso())
